wsman-api/sample/wsman.soap.session/req2.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:x="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing">
	<env:Header>
		<a:Action mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Command</a:Action>
		<a:MessageID>uuid:c5f95129-a23c-4db8-88c6-5d236d58b2cc</a:MessageID>
		<w:SelectorSet>
			<w:Selector Name="ShellId">17C45B31-ACBE-48A2-A77D-AAA9518C13AA</w:Selector>
		</w:SelectorSet>
		<w:OptionSet>
			<w:Option Name="WINRS_CONSOLEMODE_STDIN">TRUE</w:Option>
			<w:Option Name="WINRS_SKIP_CMD_SHELL">FALSE</w:Option>
		</w:OptionSet>
		<a:ReplyTo>
			<a:Address mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
		</a:ReplyTo>
		<w:MaxEnvelopeSize mustUnderstand="true">153600</w:MaxEnvelopeSize>
		<w:Locale mustUnderstand="false" xml:lang="en-US"/>
		<w:OperationTimeout>PT60S</w:OperationTimeout>
		<p:DataLocale mustUnderstand="false" xml:lang="en-US"/>
		<a:To>http://windows-host:5985/wsman</a:To>
		<w:ResourceURI mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/cmd</w:ResourceURI>
	</env:Header>
	<env:Body>
		<rsp:CommandLine>
			<rsp:Command>ipconfig</rsp:Command>
			<rsp:Arguments>/all</rsp:Arguments>
		</rsp:CommandLine>
	</env:Body>
</env:Envelope>